In [1]:
import numpy as np
import pandas as pd

In [2]:
people = {
    "First":["Sujit", "Kundan", "Saroj","Ram"],
    "Last":["Singh","Karn","Sah","chalise"],
    "Age":["23","27","24","26"],
    "Email":["SujitSingh@gmail.com","KundanKarn@gmail.com","SarojSah@gmail.com","RamChalise@gmail.com"]
}

In [3]:
people['Email']

['SujitSingh@gmail.com',
 'KundanKarn@gmail.com',
 'SarojSah@gmail.com',
 'RamChalise@gmail.com']

In [4]:
people['Age']

['23', '27', '24', '26']

In [5]:
df = pd.DataFrame(people)

In [6]:
df

    First     Last Age                 Email
0   Sujit    Singh  23  SujitSingh@gmail.com
1  Kundan     Karn  27  KundanKarn@gmail.com
2   Saroj      Sah  24    SarojSah@gmail.com
3     Ram  chalise  26  RamChalise@gmail.com

In [7]:
df[['First','Age','Email']]

    First Age                 Email
0   Sujit  23  SujitSingh@gmail.com
1  Kundan  27  KundanKarn@gmail.com
2   Saroj  24    SarojSah@gmail.com
3     Ram  26  RamChalise@gmail.com

In [8]:
df.columns

Index(['First', 'Last', 'Age', 'Email'], dtype='object')

In [9]:
df.iloc[1]

First                  Kundan
Last                     Karn
Age                        27
Email    KundanKarn@gmail.com
Name: 1, dtype: object

In [10]:
df.iloc[[0,1]]

    First   Last Age                 Email
0   Sujit  Singh  23  SujitSingh@gmail.com
1  Kundan   Karn  27  KundanKarn@gmail.com

In [11]:
df.iloc[[0,1], 3]

0    SujitSingh@gmail.com
1    KundanKarn@gmail.com
Name: Email, dtype: object

In [12]:
df.loc[[0,1],'First']

0     Sujit
1    Kundan
Name: First, dtype: object

In [13]:
df.loc[[0,1],['First','Email']]

    First                 Email
0   Sujit  SujitSingh@gmail.com
1  Kundan  KundanKarn@gmail.com

In [14]:
df.loc[0:1,'Age':'Email']

  Age                 Email
0  23  SujitSingh@gmail.com
1  27  KundanKarn@gmail.com

In [15]:
#To make First as Index.
#inplace=True is used to make permanent changes in DataFrame.
df.set_index('First', inplace=True)

In [16]:
df

           Last Age                 Email
First
Sujit     Singh  23  SujitSingh@gmail.com
Kundan     Karn  27  KundanKarn@gmail.com
Saroj       Sah  24    SarojSah@gmail.com
Ram     chalise  26  RamChalise@gmail.com

In [17]:
df.index

Index(['Sujit', 'Kundan', 'Saroj', 'Ram'], dtype='object', name='First')

In [18]:
# Now, First is Index so we can find using First only. Not by gmail, age or position 0,1,2,3. 
df.loc['Kundan']

Last                     Karn
Age                        27
Email    KundanKarn@gmail.com
Name: Kundan, dtype: object

In [19]:
#df.loc[0] will not work as First is Index now. We have to use iloc. iloc will still work.
df.iloc[0]

Last                    Singh
Age                        23
Email    SujitSingh@gmail.com
Name: Sujit, dtype: object

In [20]:
#To reset index
df.reset_index(inplace=True)

In [21]:
#Now, as before 0,1,2,3 as index. 
df

    First     Last Age                 Email
0   Sujit    Singh  23  SujitSingh@gmail.com
1  Kundan     Karn  27  KundanKarn@gmail.com
2   Saroj      Sah  24    SarojSah@gmail.com
3     Ram  chalise  26  RamChalise@gmail.com

# Filtering Data from dataset:

In [22]:
df['Last']=='Singh'

0     True
1    False
2    False
3    False
Name: Last, dtype: bool

In [23]:
filt=(df['Last']=='Singh')
df[filt]

   First   Last Age                 Email
0  Sujit  Singh  23  SujitSingh@gmail.com

In [24]:
df['Age']<='25'

0     True
1    False
2     True
3    False
Name: Age, dtype: bool

In [25]:
filt=(df['Age']<='25')
df[filt]

   First   Last Age                 Email
0  Sujit  Singh  23  SujitSingh@gmail.com
2  Saroj    Sah  24    SarojSah@gmail.com

In [26]:
df.loc[filt]

   First   Last Age                 Email
0  Sujit  Singh  23  SujitSingh@gmail.com
2  Saroj    Sah  24    SarojSah@gmail.com

In [27]:
df.loc[filt, 'Email']

0    SujitSingh@gmail.com
2      SarojSah@gmail.com
Name: Email, dtype: object

In [28]:
filt=(df['Last']=='Singh')&(df['Age']<='25')
df[filt]

   First   Last Age                 Email
0  Sujit  Singh  23  SujitSingh@gmail.com

In [29]:
filt=(df['Last']=='Singh')|(df['Age']<='25')
df[filt]

   First   Last Age                 Email
0  Sujit  Singh  23  SujitSingh@gmail.com
2  Saroj    Sah  24    SarojSah@gmail.com

In [30]:
df.loc[~filt,'Email']

1    KundanKarn@gmail.com
3    RamChalise@gmail.com
Name: Email, dtype: object

# Updating data in specific rows and columns: 1)Columns:

In [31]:
df.columns

Index(['First', 'Last', 'Age', 'Email'], dtype='object')

In [32]:
df.columns=['First Name','Last Name','Age','Email']

In [33]:
df

  First Name Last Name Age                 Email
0      Sujit     Singh  23  SujitSingh@gmail.com
1     Kundan      Karn  27  KundanKarn@gmail.com
2      Saroj       Sah  24    SarojSah@gmail.com
3        Ram   chalise  26  RamChalise@gmail.com

In [34]:
#Rename Column name:
df.rename(columns={'First Name':'First Name Please','Last Name':'Last Name Please'}, inplace=True)

In [35]:
df

  First Name Please Last Name Please Age                 Email
0             Sujit            Singh  23  SujitSingh@gmail.com
1            Kundan             Karn  27  KundanKarn@gmail.com
2             Saroj              Sah  24    SarojSah@gmail.com
3               Ram          chalise  26  RamChalise@gmail.com

# Rows:

In [36]:
df.loc[1]

First Name Please                  Kundan
Last Name Please                     Karn
Age                                    27
Email                KundanKarn@gmail.com
Name: 1, dtype: object

In [37]:
#Updating Rows data:
df.loc[2, ['First Name Please','Last Name Please','Email']]=['Nirmal','Jha','NirmalJha@gmail.com']

In [38]:
df

  First Name Please Last Name Please Age                 Email
0             Sujit            Singh  23  SujitSingh@gmail.com
1            Kundan             Karn  27  KundanKarn@gmail.com
2            Nirmal              Jha  24   NirmalJha@gmail.com
3               Ram          chalise  26  RamChalise@gmail.com

In [39]:
#Filter by specific element/value:
filt=(df['Last Name Please']=='Jha')
df[filt]

  First Name Please Last Name Please Age                Email
2            Nirmal              Jha  24  NirmalJha@gmail.com

In [40]:
#Lower case:
df['Last Name Please']=df['Last Name Please'].str.lower()

In [41]:
df

  First Name Please Last Name Please Age                 Email
0             Sujit            singh  23  SujitSingh@gmail.com
1            Kundan             karn  27  KundanKarn@gmail.com
2            Nirmal              jha  24   NirmalJha@gmail.com
3               Ram          chalise  26  RamChalise@gmail.com

In [42]:
#Upper case:
df['Last Name Please']=df['Last Name Please'].str.upper()

In [43]:
df

  First Name Please Last Name Please Age                 Email
0             Sujit            SINGH  23  SujitSingh@gmail.com
1            Kundan             KARN  27  KundanKarn@gmail.com
2            Nirmal              JHA  24   NirmalJha@gmail.com
3               Ram          CHALISE  26  RamChalise@gmail.com

# Add/Remove rows and columns from dataframe:

In [44]:
df['First Name Please'] + ' ' + df['Last Name Please']

0    Sujit SINGH
1    Kundan KARN
2     Nirmal JHA
3    Ram CHALISE
dtype: object

In [45]:
#Add Columns
df['Full Name']=df['First Name Please'] + ' ' + df['Last Name Please']
df

  First Name Please Last Name Please Age                 Email    Full Name
0             Sujit            SINGH  23  SujitSingh@gmail.com  Sujit SINGH
1            Kundan             KARN  27  KundanKarn@gmail.com  Kundan KARN
2            Nirmal              JHA  24   NirmalJha@gmail.com   Nirmal JHA
3               Ram          CHALISE  26  RamChalise@gmail.com  Ram CHALISE

In [46]:
#Drop columns
df.drop(columns=['First Name Please', 'Last Name Please'], inplace=True)
df

  Age                 Email    Full Name
0  23  SujitSingh@gmail.com  Sujit SINGH
1  27  KundanKarn@gmail.com  Kundan KARN
2  24   NirmalJha@gmail.com   Nirmal JHA
3  26  RamChalise@gmail.com  Ram CHALISE

In [47]:
#Splitting Columns
df['Full Name'].str.split(' ',expand=True)

        0        1
0   Sujit    SINGH
1  Kundan     KARN
2  Nirmal      JHA
3     Ram  CHALISE

In [48]:
#Split full name into two parts:
df[['First Name','Last Name']] =df['Full Name'].str.split(' ',expand=True)

In [49]:
df

  Age                 Email    Full Name First Name Last Name
0  23  SujitSingh@gmail.com  Sujit SINGH      Sujit     SINGH
1  27  KundanKarn@gmail.com  Kundan KARN     Kundan      KARN
2  24   NirmalJha@gmail.com   Nirmal JHA     Nirmal       JHA
3  26  RamChalise@gmail.com  Ram CHALISE        Ram   CHALISE

In [50]:
#Adding Rows:
people1={
    'First Name':['Abhishek','Bibhuti'],
    'Last Name':['Jha','Jha'],
    'Age':['25','28'],
    'Full Name':['Abhishek Jha','Bibhuti Jha'],
    'Email':['AbhishekJha@gmail.com','BibhutiJha@gmail.com']
}
df2=pd.DataFrame(people1)

In [51]:
df2

  First Name Last Name Age     Full Name                  Email
0   Abhishek       Jha  25  Abhishek Jha  AbhishekJha@gmail.com
1    Bibhuti       Jha  28   Bibhuti Jha   BibhutiJha@gmail.com

In [54]:
df.append(df2, ignore_index=True, sort=False)

C:\Users\HP\AppData\Local\Temp\ipykernel_9912\2503217469.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append(df2, ignore_index=True, sort=False)

  Age                  Email     Full Name First Name Last Name
0  23   SujitSingh@gmail.com   Sujit SINGH      Sujit     SINGH
1  27   KundanKarn@gmail.com   Kundan KARN     Kundan      KARN
2  24    NirmalJha@gmail.com    Nirmal JHA     Nirmal       JHA
3  26   RamChalise@gmail.com   Ram CHALISE        Ram   CHALISE
4  25  AbhishekJha@gmail.com  Abhishek Jha   Abhishek       Jha
5  28   BibhutiJha@gmail.com   Bibhuti Jha    Bibhuti       Jha

In [55]:
#Remove Rows:
df.drop(index=4)

KeyError: '[4] not found in axis'